[
  {
    "id": 1,
    "photo": "https://hawkticehurst.com/imgs/hero.png",
    "instructor": "Masum Rana",
    "ins-photo": "https://media.licdn.com/dms/image/D4D03AQFUTwJieGRHUA/profile-displayphoto-shrink_800_800/0/1675939288005?e=1683763200&v=beta&t=p2t_MJI2IyijbNXyP2cekFj58XdNZpYOFES11mgCvXw",
    "title": "Full-Stack Web Development",
    "introduction": "In this course, you will learn the fundamentals of HTML, the building block of the web. You'll discover the essential concepts of HTML such as tags, attributes, and elements, and how they work together to create web pages. By the end of this course, you'll have a solid understanding of how to create basic web pages with HTML.",
    "description": "This course focuses on HTML5, the latest version of HTML. You'll learn about the new features and improvements of HTML5, including semantic markup, multimedia integration, and canvas graphics. You'll also learn how to use the new form input types and how to write clean and efficient code. By the end of this course, you'll be able to create modern, dynamic web pages using HTML5. In this course, you'll dive deeper into HTML and learn more advanced techniques such as responsive design, accessibility, and SEO optimization. You'll also learn how to use popular HTML frameworks such as Bootstrap and Foundation to create beautiful, responsive web pages. By the end of this course, you'll have the skills to build complex web pages that are accessible and optimized for search engines.",
    "duration": "8 Month",
    "price": "214",
    "others": {
      "rating": "4.2",
      "people": "5300"
    }
  },
  {
    "id": 2,
    "photo": "https://banner2.cleanpng.com/20180708/jpo/kisspng-android-studio-java-mobile-app-development-java-wedding-5b42441724de48.613631831531069463151.jpg",
    "instructor": "Tareq Wasif",
    "ins-photo": "https://scontent.fdac144-1.fna.fbcdn.net/v/t39.30808-6/237045806_514948552901040_6333660949713924268_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=174925&_nc_eui2=AeFWoA_rs5uDV92Hn3HhmTsp-P7Fpc5d1-z4_sWlzl3X7OvfEcQxM_DtPb3TX179efEi85Yl6pjf30ounPGrGBsz&_nc_ohc=COObzT7jrvUAX_bYdAy&_nc_ht=scontent.fdac144-1.fna&oh=00_AfCVuSldK81wsXMPIvC-1AqhIw_nseCUd6rneIzxFNTG4g&oe=64098704",
    "title": "Android App Development: From Beginner to Advanced",
    "introduction": "Welcome to Android App Development with Java, Python, JavaScript, and React Native! In this course, you'll learn how to develop mobile applications for the Android platform using a combination of Java, Python, JavaScript, and React Native. Whether you're a beginner or an experienced developer, this course has everything you need to create high-quality, user-friendly Android apps using these powerful programming languages and frameworks.",
    "description": "This course covers all aspects of Android app development using Java, Python, JavaScript, and React Native, including user interface design, data storage, network connectivity, and multimedia. You'll learn how to use Android Studio, the official development environment for Android, as well as JavaScript libraries and React Native components to create and deploy your applications. We'll cover topics such as user input, user interface components, layouts, menus, and dialogs. You'll also learn how to work with databases, content providers, services, and broadcast receivers. By the end of the course, you'll have the skills and knowledge to create professional-grade Android applications that are functional, efficient, and visually appealing.Note that the specific topics covered in the course may vary depending on the specifics of your course, but this should give you an idea of how to structure a name, title, introduction, and description for a course on Android app development using Java, Python, JavaScript, and React Native.",
    "duration": "6 Month",
    "price": "300",
    "others": {
      "rating": "4.8",
      "people": "400"
    }
  },
  {
    "id": 3,
    "photo": "https://www.hiddenbrains.com/blog/wp-content/uploads/2020/02/iOS-App-Development-Trends.jpg",
    "title": "iOS Development with Swift ",
    "instructor":"Olivia Davis",
    "ins-photo":"https://mir-s3-cdn-cf.behance.net/project_modules/max_1200/35af6a41332353.57a1ce913e889.jpg",
    "introduction": "Welcome to iOS Development with Swift: From Beginner to Advanced! In this course, you'll learn how to develop mobile applications for the iOS platform using the Swift programming language, from basic concepts to advanced techniques. Whether you're a beginner or an experienced developer, this course has everything you need to get started with iOS app development and create high-quality, user-friendly applications.",
    "description": "This course covers all aspects of iOS app development with Swift, including user interface design, data storage, network connectivity, and multimedia. You'll learn how to use Xcode, the official development environment for iOS, to create and deploy your applications. We'll cover topics such as user input, user interface components, layouts, menus, and dialogs. You'll also learn how to work with databases, content providers, services, and notifications. By the end of the course, you'll have the skills and knowledge to create professional-grade iOS applications that are functional, efficient, and visually appealing. Note that the specific topics covered in the course may vary depending on the specifics of your course, but this should give you an idea of how to structure a name, title, introduction, and description for a course on iOS app development with Swift.",
    "duration": "7 Month",
    "price": "223",
    "others": {
      "rating": "4.3",
      "people": "500"
    }
  },
  {
    "id": 4,
    "photo": "https://thumbs.dreamstime.com/b/seo-search-engine-optimization-marketing-ranking-traffic-website-internet-business-technology-concept-seo-search-engine-137939507.jpg",
    "ins-photo":"https://pbs.twimg.com/media/DZotU1hW0AEDN5F.jpg:large",
    "instructor":"Jahon Swimth",
    "title": "SEO Fundamentals",
    "introduction": "Welcome to SEO Fundamentals: Boosting Your Website's Visibility! In this course, you'll learn the basics of search engine optimization (SEO) and how to improve your website's visibility in search engine results pages. Whether you're a business owner, marketer, or website developer, this course has everything you need to understand the principles of SEO and apply them to your website",
    "description": "This course covers all the fundamental aspects of SEO, including keyword research, on-page optimization, link building, and analytics. You'll learn how to create content that's optimized for search engines, how to structure your website to be easily crawlable by search engine bots, and how to build high-quality backlinks to improve your website's authority. We'll also cover the importance of analytics and how to use tools like Google Analytics to track your website's performance and make data-driven decisions to improve your SEO strategy. By the end of the course, you'll have a solid understanding of the principles of SEO and the tools and techniques needed to improve your website's visibility in search engine results pages. Note that the specific topics covered in the course may vary depending on the specifics of your course, but this should give you an idea of how to structure a name, title, introduction, and description for a course on SEO fundamentals.",
    "duration":"5 Month",
    "price": "523",
    "others": {
      "rating": "3.4",
      "people": "300"
    }
  },
  {
    "id": 5,
    "photo": "https://www.freecodecamp.org/news/content/images/2022/11/What-is.png",
    "instructor":"Janntul Bithi",
    "ins-photo":"https://bup.edu.bd/system/uploads/club/second_member_image/18/4094.jpg",
    "title": "Graphic Design Fundamentals",
    "introduction": "Welcome to Graphic Design Fundamentals: Creating Eye-Catching Visuals! In this course, you'll learn the basics of graphic design and how to create visually appealing and effective designs for a variety of media. Whether you're a beginner or an experienced designer, this course has everything you need to understand the principles of graphic design and apply them to your projects.",
    "description": "This course covers all the essential aspects of graphic design, including color theory, typography, layout, composition, and visual hierarchy. You'll learn how to use design software like Adobe Photoshop and Illustrator, as well as how to work with vector graphics, digital images, and typography. We'll also cover the importance of branding and how to create consistent and recognizable designs that reflect your brand's values and personality. By the end of the course, you'll have the skills and knowledge to create stunning graphics for a variety of media, including print and digital.Note that the specific topics covered in the course may vary depending on the specifics of your course, but this should give you an idea of how to structure a name, title, introduction, and description for a course on graphic design fundamentals.",
    "duration":"6 Month",
    "price": "123",
    "others": {
      "rating": "4.0",
      "people": "4300"
    }
  },
  {
    "id": 6,
    "photo": "https://www.static-contents.youth4work.com/prep/img/categoryimages/6a9c12ca-e4c2-4f66-910d-fd2959e4e63d_subject_800x450.png",
    "instructor":"Asraful Islam",
    "ins-photo":"https://scontent.fdac144-1.fna.fbcdn.net/v/t39.30808-6/260172604_2047743548728094_221857429542605554_n.jpg?_nc_cat=106&ccb=1-7&_nc_sid=09cbfe&_nc_eui2=AeF8DoES3-C2uDzp0XqV8dg2PCjl3foZiKU8KOXd-hmIpWaMGqFAqqe6AEqdMRcoj9EaniFbt3R3lwJADGR-fJZ1&_nc_ohc=e9FBRFOJZnQAX9Kd_Lx&_nc_ht=scontent.fdac144-1.fna&oh=00_AfCUO0IeHc62fd1S25n8t6OqXIbdgiZVrMPPnLYmWMG98w&oe=6408C5A0",
    "title": "Computer Science Fundamentals",
    "introduction": "I Welcome to Computer Science Fundamentals: Essential Concepts and Skills! In this course, you'll learn the fundamental concepts and skills needed to understand and solve problems in computer science. Whether you're a beginner or an experienced programmer, this course has everything you need to understand the basics of computer science and apply them to real-world problems.",
    "description": "This course covers all the essential aspects of computer science, including programming fundamentals, algorithms, data structures, and software development principles. You'll learn how to use programming languages like Python and Java to write programs that solve problems and manipulate data. We'll also cover the importance of data structures and algorithms and how to use them to optimize program efficiency. Additionally, we'll discuss software development principles, such as object-oriented programming, debugging techniques, and version control. By the end of the course, you'll have a solid understanding of the fundamental concepts and skills needed to succeed in computer science.Note that the specific topics covered in the course may vary depending on the specifics of your course, but this should give you an idea of how to structure a name, title, introduction, and description for a course on computer science fundamentals.",
    "price": "223",
    "others": {
      "rating": "4.3",
      "people": "200"
    }
  },
  {
    "id": 7,
    "photo": "https://i.pinimg.com/originals/b1/da/21/b1da2108a0068ceb177aaaecd11ac52c.png",
    "instructor":"Shah-Imran",
    "ins-photo":"https://scontent.fdac144-1.fna.fbcdn.net/v/t39.30808-6/315649540_2079773245557556_4770150596438099757_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=8bfeb9&_nc_eui2=AeHHXWR-Ifdvsan7x7GITE7M___yHrIp5-H___Iesinn4UWO5CD3ZHi5U41n4kQV-pHL2oHN4bUwKeuHLjJM7v3N&_nc_ohc=2lOGBgumwWcAX9Sel7U&_nc_ht=scontent.fdac144-1.fna&oh=00_AfAGjyiDzhVWlaCoe8QaL1AVXH07nsYGEoqERR6CmaKv3g&oe=6408D94C",
    "title": "Database Management Fundamentals",
    "introduction": "Welcome to Database Management Fundamentals: SQL, Oracle, MySQL, and More! In this course, you'll learn the fundamental concepts and skills needed to manage databases using SQL, Oracle, MySQL, and other popular database management systems. Whether you're a beginner or an experienced database administrator, this course has everything you need to understand the basics of database management and apply them to real-world scenarios.",
    "description": "This course covers all the essential aspects of database management, including database design, data modeling, data normalization, and SQL programming. You'll learn how to create and manage databases using popular database management systems like Oracle and MySQL, as well as how to write SQL queries to retrieve, manipulate, and analyze data. We'll also cover advanced topics like database security, backup and recovery, and database performance tuning. By the end of the course, you'll have the skills and knowledge to manage databases effectively and efficiently using SQL, Oracle, MySQL, and other popular database management systems.Note that the specific topics covered in the course may vary depending on the specifics of your course, but this should give you an idea of how to structure a name, title, introduction, and description for a course on database management fundamentals.",
    "price": "223",
    "others": {
      "rating": "4.3",
      "people": "200"
    }
  },
  {
    "id": 8,
    "photo": "https://cdn1.vectorstock.com/i/1000x1000/39/00/ai-artificial-intelligence-machine-learning-big-vector-29103900.jpg",
    "instructor":"Shah-Imran",
    "ins-photo":"https://scontent.fdac144-1.fna.fbcdn.net/v/t39.30808-6/315649540_2079773245557556_4770150596438099757_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=8bfeb9&_nc_eui2=AeHHXWR-Ifdvsan7x7GITE7M___yHrIp5-H___Iesinn4UWO5CD3ZHi5U41n4kQV-pHL2oHN4bUwKeuHLjJM7v3N&_nc_ohc=2lOGBgumwWcAX9Sel7U&_nc_ht=scontent.fdac144-1.fna&oh=00_AfAGjyiDzhVWlaCoe8QaL1AVXH07nsYGEoqERR6CmaKv3g&oe=6408D94C",
    "title": "Artificial Intelligence (AI) and Machine Learning (ML)",
    "introduction": " Welcome to Artificial Intelligence (AI) and Machine Learning (ML) Fundamentals: Concepts and Applications! In this course, you'll learn the basic concepts and skills needed to understand and apply AI and ML technologies. Whether you're a beginner or an experienced data scientist, this course has everything you need to understand the basics of AI and ML and apply them to real-world scenarios.",
    "description": "This course covers all the essential aspects of AI and ML, including data preprocessing, feature extraction, modeling, and evaluation. You'll learn how to use popular programming languages and frameworks like Python and TensorFlow to build AI and ML models for tasks like image recognition, natural language processing, and predictive analytics. We'll also cover advanced topics like deep learning, reinforcement learning, and neural networks. By the end of the course, you'll have the skills and knowledge to build and apply AI and ML models effectively and efficiently.Note that the specific topics covered in the course may vary depending on the specifics of your course, but this should give you an idea of how to structure a name, title, introduction, and description for a course on AI and ML fundamentals.",
    "price": "200",
    "others": {
      "rating": "4.5",
      "people": "800"
    }
  },
  {
    "id": 9,
    "photo": "https://www.digitalmarketinginudaipur.com/wp-content/uploads/2021/09/Fundamentals-of-Digital-Marketing-1.jpg",
    "instructor":"Omuk Hasan",
    "ins-photo":"https://scontent.fdac144-1.fna.fbcdn.net/v/t39.30808-6/315649540_2079773245557556_4770150596438099757_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=8bfeb9&_nc_eui2=AeHHXWR-Ifdvsan7x7GITE7M___yHrIp5-H___Iesinn4UWO5CD3ZHi5U41n4kQV-pHL2oHN4bUwKeuHLjJM7v3N&_nc_ohc=2lOGBgumwWcAX9Sel7U&_nc_ht=scontent.fdac144-1.fna&oh=00_AfAGjyiDzhVWlaCoe8QaL1AVXH07nsYGEoqERR6CmaKv3g&oe=6408D94C",
    "title": "Digital Marketing Fundamentals",
    "introduction": "Welcome to Digital Marketing Fundamentals: Strategies and Techniques for Success! In this course, you'll learn the essential strategies and techniques used in digital marketing to grow your business online. Whether you're a beginner or an experienced marketer, this course has everything you need to understand the basics of digital marketing and apply them to real-world scenarios.",
    "description": "This course covers all the essential aspects of digital marketing, including search engine optimization (SEO), pay-per-click (PPC) advertising, social media marketing, email marketing, and content marketing. You'll learn how to create effective marketing campaigns using popular tools like Google Ads, Facebook Ads, and Mailchimp. We'll also cover advanced topics like marketing analytics and conversion rate optimization. By the end of the course, you'll have the skills and knowledge to create and execute successful digital marketing campaigns that drive traffic, leads, and sales.Note that the specific topics covered in the course may vary depending on the specifics of your course, but this should give you an idea of how to structure a name, title, introduction, and description for a course on digital marketing fundamentals.",
    "price": "150",
    "others": {
      "rating": "3.8",
      "people": "500"
    }
  },
  {
    "id": 10,
    "photo": "https://www.scnsoft.com/blog-pictures/itsm/how-can-a-system-administrator-turn-into-a-devops-engineer.png",
    "instructor":"Rakib Hasan",
    "ins-photo":"https://media.licdn.com/dms/image/C5603AQHcJh-8SPL-8g/profile-displayphoto-shrink_800_800/0/1627867705289?e=2147483647&v=beta&t=YdLSEf6bhkwOFFoFilYq9nY4JLn6upRc3fD8ZLvA-EA",
    "title": "Operating Systems and System Administration",
    "introduction": "Welcome to Operating Systems and System Administration Fundamentals: Concepts and Best Practices! In this course, you'll learn the fundamental concepts and best practices needed to effectively manage and maintain computer systems running operating systems like Linux, Windows, and macOS. Whether you're a beginner or an experienced system administrator, this course has everything you need to understand the basics of operating systems and system administration and apply them to real-world scenarios.",
    "description": "This course covers all the essential aspects of operating systems and system administration, including installation and configuration, file systems, process management, system security, and networking. You'll learn how to manage and troubleshoot common system administration tasks using command-line tools and graphical user interfaces. We'll also cover advanced topics like virtualization, containerization, and cloud computing. By the end of the course, you'll have the skills and knowledge to effectively manage and maintain computer systems running operating systems like Linux, Windows, and macOS.Note that the specific topics covered in the course may vary depending on the specifics of your course, but this should give you an idea of how to structure a name, title, introduction, and description for a course on operating systems and system administration fundamentals.",
    "price": "300",
    "others": {
      "rating": "4.5",
      "people": "1056"
    }
  }
]
